# St7GetInitialTemperatureTHA

Returns the temperature used as the initial temperature for the result file currently open.

long St7GetInitialTemperatureTHA(long uID, double* InitialTemp)
Input Parameters
uID
Strand7 model file ID.

Output Parameters
InitialTemp
Initial temperature.
Applicability
Applicable to stTransientHeat.